# TECHMIMO


Autor: Rafael Pereira da Silva

Seguem alguns recados para ajudá-los e para contribuir com o curso:

- Fiquem à vontade para me contatar pelo Linkdin, costumo responder por lá também: https://www.linkedin.com/in/rafael-pereira-da-silva-23890799/

- Fiquem a vontade para compartilharem o certificado do curso no Linkedin. Eu costumo curtir e comentar para dar mais credibilidade

- Vocês podem usar esses notebooks para resolver os exercícios e desafios

- Não se esqueçam de avaliar o curso e dar feedback, eu costumo criar conteúdos baseado nas demandas de vocês
- Se tiverem gostando do curso, recomendem aos amigos, pois isso também ajuda a impulsionar e a crescer a comunidade
-  Bons estudos e grande abraços!

## Sobre o Material

Este material é parte do curso **Python para Engenheiros e Cientistas** e está sobre a licença MIT.
Caso você tenha interesse em conhecer o curso, acesso o link abaixo.


https://www.udemy.com/course/python-para-engenheiros-e-cientistas/?referralCode=FA25B2C024FF2D3F8232


Algumas aulas, exercícios e desafios estarão sem códigos propositalmente para que o aluno possa preencher.

# Seção 9 - Fundamentos de Pandas

Acesse:
https://pandas.pydata.org/docs/user_guide/index.html

Acesse: https://pandas.pydata.org/docs/user_guide/index.html

Dados em csv:
https://www.kaggle.com/drgilermo/nba-players-stats

## 9.1 - Estrutura de dados no Pandas


*Series* - *Series* são estruturas de dados 1D e podem ser criadas a partir de dicionários, arrays, entre outros. É muito parecido com os arrays em termos de propriedades e métodos.
- pd.Series(data, index=index)

*DataFrame* - *DataFrames* são estruturas de dados 2D e podem ser criadas a partir de dicionários, dados estruturados em 2D, arquivos csv, etc. Em resumo, DataFrame é uma **tabela**.
- pd.DataFrame({'key_1': pd.Series(...), 'key_n':pd.Series(...)})
- pd.read_csv(file)

In [57]:
# Dados

lista_a = [11,22,33,44,55]
lista_b = ['a','b','c','d','e']

import numpy as np

arr = np.arange(10)**2

dic = {'a':123,'b':456,'c':789}

dic2 = {'coluna1':np.arange(10)*5,'coluna2':np.arange(10)**2,'coluna3':np.ones(10)}
dic2['coluna1']

array([ 0,  5, 10, 15, 20, 25, 30, 35, 40, 45])

In [50]:
import pandas as pd


serie_1 = pd.Series(lista_b,index=lista_a)
serie_1[22]

'b'

In [52]:
serie_3 = pd.Series(arr)
serie_3

0     0
1     1
2     4
3     9
4    16
5    25
6    36
7    49
8    64
9    81
dtype: int32

In [55]:
serie_4 = pd.Series(dic)
serie_4['a']

123

In [61]:
df1 = pd.DataFrame(dic2)
type(df1['coluna1'])

pandas.core.series.Series

In [63]:
arr2 = np.arange(15).reshape(5,3)


df3 = pd.DataFrame(arr2)

df3

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [64]:
file = 'datasets_1358_30676_Players.csv'

NBA_players = pd.read_csv(file)
NBA_players

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
0,0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
2,2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN
3,3,Ed Bartels,196.0,88.0,North Carolina State University,1925.0,NaN,NaN
4,4,Ralph Beard,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky
...,...,...,...,...,...,...,...,...
3917,3917,Troy Williams,198.0,97.0,South Carolina State University,1969.0,Columbia,South Carolina
3918,3918,Kyle Wiltjer,208.0,108.0,Gonzaga University,1992.0,Portland,Oregon
3919,3919,Stephen Zimmerman,213.0,108.0,"University of Nevada, Las Vegas",1996.0,Hendersonville,Tennessee
3920,3920,Paul Zipser,203.0,97.0,NaN,1994.0,Heidelberg,Germany
3921,3921,Ivica Zubac,216.0,120.0,NaN,1997.0,Mostar,Bosnia and Herzegovina

## 9.2 Funcionalidades básicas

Acesse: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html


#### Algumas propriedades de DataFrames

shape, size, dtypes, columns, index (retorna linhas), values (retorna array)


#### Alguns métodos para DataFrames


| Métodos aplicados ao DataFrame | Descrição |
| :-- | :-- |
| .head(*optativo*) | para ver primeiras linhas |
| .tail(*optativo*) | para ver últimas linhas |
| .to_csv(*path/name*) |  exporta o DF para um arquivo csv (esse método existe para vários outros formatos) |
| .min(axis), .max(axis), .cumsum(),mean() | similar as discutidas na seção de Numpy |
| .value_counts() | Este método faz uma contagem de aparições de determinado valor (aplicar para Series) |
| .sort_values(by=column) | Ordena valores. |

In [68]:
import pandas as pd


lista_a = ['a','a','b','c','a','d','c']

lista_b = list(range(7))

dic = {'string':lista_a,'numeros':lista_b}
dic

{'string': ['a', 'a', 'b', 'c', 'a', 'd', 'c'],
 'numeros': [0, 1, 2, 3, 4, 5, 6]}

In [81]:
df = pd.DataFrame(dic)

type(df.values)

numpy.ndarray

In [88]:
import numpy as np

df2 = pd.DataFrame({'col1':np.arange(100)**2,'col2':np.arange(100)*5})
df2.tail()

    col1  col2
95  9025   475
96  9216   480
97  9409   485
98  9604   490
99  9801   495

In [96]:
df.cumsum()

    string  numeros
0        a        0
1       aa        1
2      aab        3
3     aabc        6
4    aabca       10
5   aabcad       15
6  aabcadc       21

In [98]:
df['string'].value_counts()

a    3
c    2
d    1
b    1
Name: string, dtype: int64

In [100]:
df.sort_values(by='string')

  string  numeros
0      a        0
1      a        1
4      a        4
2      b        2
3      c        3
6      c        6
5      d        5

## 9.3 Tratando dados (Exemplo prático 1)

A partir dos dados de jogadores da NBA (https://www.kaggle.com/drgilermo/nba-players-stats), pede-se:

- Qual a média de altura e de peso dos jogadores?
- Crie uma nova coluna com a razão peso/altura.
- Qual a maior altura, o maior peso, a menor altura e menor peso?
- Qual é o estado onde nasce o maior número de jogadores?
- Qual o jogador mais alto?

In [103]:
import pandas as pd


file = 'datasets_1358_30676_Players.csv'

df = pd.read_csv(file)

df.head()

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
0,0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
2,2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN
3,3,Ed Bartels,196.0,88.0,North Carolina State University,1925.0,NaN,NaN
4,4,Ralph Beard,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky

In [104]:
df.columns

Index(['Unnamed: 0', 'Player', 'height', 'weight', 'collage', 'born',
       'birth_city', 'birth_state'],
      dtype='object')

In [106]:
df['height'].mean()

198.70492221372098

In [107]:
df['weight'].mean()

94.78321856669217

In [115]:
IMC = df['weight']/((df['height']/100)**2)
IMC

0       23.765432
1       23.483477
2       23.087868
3       22.907122
4       24.933720
          ...
3917    24.742373
3918    24.963018
3919    23.804801
3920    23.538547
3921    25.720165
Length: 3922, dtype: float64

In [116]:
df['IMC'] = IMC

df.head()

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state,razao,IMC
0,0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN,0.427778,23.765432
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana,0.441489,23.483477
2,2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN,0.445596,23.087868
3,3,Ed Bartels,196.0,88.0,North Carolina State University,1925.0,NaN,NaN,0.448980,22.907122
4,4,Ralph Beard,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky,0.443820,24.933720

In [117]:
df.mean()

Unnamed: 0    1960.500000
height         198.704922
weight          94.783219
born          1962.379750
razao            0.475704
IMC             23.926953
dtype: float64

In [118]:
df.min()

Unnamed: 0       0.000000
height         160.000000
weight          60.000000
born          1913.000000
razao            0.357143
IMC             16.866251
dtype: float64

In [119]:
df.max()

Unnamed: 0    3921.000000
height         231.000000
weight         163.000000
born          1997.000000
razao            0.721239
IMC             31.913227
dtype: float64

In [120]:
df['birth_state'].value_counts()

California                          344
New York                            290
Illinois                            209
Pennsylvania                        163
Ohio                                137
                                   ...
Saint Vincent and the Grenadines      1
South Africa                          1
Morocco                               1
Cape Verde                            1
New Hampshire                         1
Name: birth_state, Length: 128, dtype: int64

In [124]:
df.sort_values(by='height').tail(20)

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state,razao,IMC
2547,2547,Zydrunas Ilgauskas,221.0,107.0,NaN,1975.0,Kaunas,Lithuania,0.484163,21.907823
3814,3814,Kristaps Porzingis,221.0,108.0,NaN,1995.0,Liepaja,Latvia,0.488688,22.112569
3381,3381,Hasheem Thabeet,221.0,119.0,University of Connecticut,1987.0,Dar es Salaam,United Republic of Tanzania,0.538462,24.364775
3812,3812,Tibor Pleiss,221.0,116.0,NaN,1989.0,Bergisch Gladbach,Germany,0.524887,23.750537
3822,3822,Walter Tavares,221.0,117.0,NaN,1992.0,Maio,Cape Verde,0.529412,23.955283
1540,1540,Mark Eaton,224.0,124.0,"University of California, Los Angeles",1957.0,Westminster,California,0.553571,24.713010
2482,2482,Priest Lauderdale,224.0,147.0,Central State University,1973.0,Chicago,Illinois,0.656250,29.296875
1631,1631,Ralph Sampson*,224.0,103.0,University of Virginia,1960.0,Harrisonburg,Virginia,0.459821,20.527742
1956,1956,Rik Smits,224.0,113.0,Marist College,1966.0,Eindhoven,Netherlands,0.504464,22.520727
3017,3017,Pavel Podkolzin,226.0,117.0,NaN,1985.0,Novosibirsk,Russia,0.517699,22.907040
3018,3018,Peter John,226.0,117.0,NaN,1985.0,NaN,NaN,0.517699,22.907040
2969,2969,Slavko Vranes,226.0,124.0,NaN,1983.0,Belgrade,Serbia,0.548673,24.277547
3686,3686,Sim Bhullar,226.0,163.0,New Mexico State University,1992.0,Ontario,Canada,0.721239,31.913227
1563,1563,Chuck Nevitt,226.0,98.0,North Carolina State University,1959.0,Cortez,Colorado,0.433628,19.187094
2878,2878,Yao Ming*,229.0,140.0,NaN,1980.0,Shanghai,China,0.611354,26.696669
2249,2249,P.J. Brown,229.0,106.0,NaN,1972.0,NaN,NaN,0.462882,20.213192
2248,2248,Shawn Bradley,229.0,106.0,Brigham Young University,1972.0,Landstuhl,Germany,0.462882,20.213192
1711,1711,Manute Bol,231.0,90.0,University of Bridgeport,1962.0,Gogrial,South Sudan,0.389610,16.866251
2297,2297,Gheorghe Muresan,231.0,137.0,NaN,1971.0,Triteni,Romania,0.593074,25.674182
223,223,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## 9.4 Fatiando DataFrames com loc e iloc
Acesse: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html


- loc[i,j], onde i e j são os nomes dos índices
- iloc[i,j], onde i e j são os números dos índices

In [161]:
import pandas as pd

file = 'datasets_1358_30676_Players.csv'

df = pd.read_csv(file)
df.head()

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
0,0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
2,2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN
3,3,Ed Bartels,196.0,88.0,North Carolina State University,1925.0,NaN,NaN
4,4,Ralph Beard,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky

In [163]:
df.columns

Index(['Unnamed: 0', 'Player', 'height', 'weight', 'collage', 'born',
       'birth_city', 'birth_state'],
      dtype='object')

In [168]:
df.loc[1:4,'height':'birth_state']

,height,weight,collage,born,birth_city,birth_state
1,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
2,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN
3,196.0,88.0,North Carolina State University,1925.0,NaN,NaN
4,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky

In [173]:
df.iloc[0:50:3,2:5]

    height  weight                          collage
0    180.0    77.0               Indiana University
3    196.0    88.0  North Carolina State University
6    196.0    90.0             University of Kansas
9    196.0    95.0             University of Denver
12   190.0    79.0        Oklahoma State University
15   185.0    81.0       Louisiana State University
18   208.0   106.0                              NaN
21   190.0    79.0            Seton Hall University
24   196.0    90.0      East Texas State University
27   190.0    83.0       Louisiana State University
30   188.0    81.0          University of Wisconsin
33   183.0    81.0            Georgetown University
36   185.0    74.0       University of Pennsylvania
39   185.0    79.0            Seton Hall University
42   183.0    79.0              New York University
45   198.0    88.0        College of William & Mary
48   188.0    79.0                Butler University

## 9.5 Função merge e função concat

Acesse: https://pandas.pydata.org/docs/user_guide/merging.html

De forma resumida, a função concat nos auxilia em combinar, concatenar os DataFrames. A função merge nos ajuda a fundir os DataFrames, tendo uma funcionalidade parecida com o procv do Excel.

- pandas.concat(objs: Union[Iterable[FrameOrSeries], Mapping[Label, FrameOrSeries]], axis='0', join: str = "'outer'", ignore_index: bool = 'False', keys='None', levels='None', names='None', verify_integrity: bool = 'False', sort: bool = 'False', copy: bool = 'True')


- pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=True, suffixes=('_x', '_y'), copy=True, indicator=False,validate=None)

In [1]:
# A ser preenchido pelo aluno

## 9.6 Índices booleanos

Os índices booleanos nos auxiliam a aplicar filtros nos dataframes.

In [56]:
import pandas as pd

file = 'datasets_1358_30676_Players.csv'

df = pd.read_csv(file)
df.head(5)

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
0,0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
2,2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN
3,3,Ed Bartels,196.0,88.0,North Carolina State University,1925.0,NaN,NaN
4,4,Ralph Beard,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky

In [57]:
df.columns

Index(['Unnamed: 0', 'Player', 'height', 'weight', 'collage', 'born',
       'birth_city', 'birth_state'],
      dtype='object')

In [58]:
df['birth_state'].value_counts()

California                     344
New York                       290
Illinois                       209
Pennsylvania                   163
Ohio                           137
                              ...
Estonia                          1
Denmark                          1
United Republic of Tanzania      1
Trinidad and Tobago              1
South Africa                     1
Name: birth_state, Length: 128, dtype: int64

In [61]:
From_California = df['birth_state'] =='California'

From_California.value_counts()

False    3578
True      344
Name: birth_state, dtype: int64

In [63]:
df[From_California].head(2)

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
22,22,Bill Calhoun,190.0,81.0,City College of San Francisco,1927.0,San Francisco,California
50,50,Bob Feerick,190.0,86.0,Santa Clara University,1920.0,San Francisco,California

In [65]:
after_1970 = df['born']>1970

df[after_1970]

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
2217,2217,Harold Miner,196.0,95.0,University of Southern California,1971.0,Inglewood,California
2220,2220,Tracy Murray,201.0,102.0,"University of California, Los Angeles",1971.0,Los Angeles,California
2222,2222,Shaquille O'Neal*,216.0,147.0,Louisiana State University,1972.0,Newark,New Jersey
2246,2246,Vin Baker,211.0,105.0,University of Hartford,1971.0,Lake Wales,Florida
2248,2248,Shawn Bradley,229.0,106.0,Brigham Young University,1972.0,Landstuhl,Germany
...,...,...,...,...,...,...,...,...
3916,3916,Isaiah Whitehead,193.0,96.0,Seton Hall University,1995.0,Brooklyn,New York
3918,3918,Kyle Wiltjer,208.0,108.0,Gonzaga University,1992.0,Portland,Oregon
3919,3919,Stephen Zimmerman,213.0,108.0,"University of Nevada, Las Vegas",1996.0,Hendersonville,Tennessee
3920,3920,Paul Zipser,203.0,97.0,NaN,1994.0,Heidelberg,Germany
3921,3921,Ivica Zubac,216.0,120.0,NaN,1997.0,Mostar,Bosnia and Herzegovina

## 9.7 Tabela dinâmica (Tratando carteira de ações)



- pivot_table(values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False)

In [2]:
# A ser preenchido pelo aluno

## 9.8 Visualização de gráficos com Pandas


Nesta seção veremos:

- df.plot(x='x',y='y')
- df.plot.bar(x='x',y='y')
- df.plot.pie(subplots=True ou y='y')
- df.plot.scatter(x='x',y='y')


Acesse: https://pandas.pydata.org/docs/user_guide/visualization.html#visualization-hist

In [3]:
# A ser preenchido pelo aluno

## 9.9 Tratando dados de intinerários (Exemplo prático 2)

Dados horários de intinerários, pede-se:
- Encontre e filtre as razões sociais que se repetem duas vezes;
- Encontre quais delas possuem intervalos em menos de uma hora.

https://dados.antt.gov.br/dataset/gerenciamento-de-autorizacoes

Uso do método **.isin** e da função **pd.to_datetime**

In [4]:
# A ser preenchido pelo aluno

## 9.10 - Preparando os dados

#### Alguns métodos para DataFrames


| Métodos aplicados ao DataFrame | Descrição |
| :-- | :-- |
| .drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise') | Remove uma série de dados especificada |
| .isnull(obj)/.notnull(obj) | cria uma série de booleanos |
| .dropna(axis=0, how='any', thresh=None, subset=None, inplace=False) | Deleta linha (axis=0) ou coluna (axis=1) com célula(s) nula(s) |
| .fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None) | Substitui o valor nulo por um valor determinado |
| .duplicated(subset=None, keep='first') | retorna um booleano com valores duplicados |
| .drop_duplicates(subset=None, keep='first', inplace=False, ignore_index=False) | deleta linhas com valores duplicados. Pode selecionar uma determinada coluna usando subset |


Atenção, esses métodos não modificam o DataFrame

In [5]:
# A ser preenchido pelo aluno

## 9.11 Multi índices (ex. com pyNastran)

Objetos multi índices:

MultiIndex.from_tuples(tuples, sortorder=None, names=None)

MultiIndex.from_arrays(arrays, sortorder=None, names=<object object>)
    
MultiIndex.from_frame(df, sortorder=None, names=None)

In [2]:
import numpy as np

a_arr = np.arange(10).reshape(5,2)
a_arr

array([[0, 1],
       [2, 3],
       [4, 5],
       [6, 7],
       [8, 9]])

In [14]:
a_index = pd.MultiIndex.from_tuples([('A',1),('A',2),('B',1),('B',2),('B',3)],names=['first','second'])
type(a_index)

pandas.core.indexes.multi.MultiIndex

In [15]:
import pandas as pd

a_df = pd.DataFrame(a_arr,index=a_index)
a_df

              0  1
first second
A     1       0  1
      2       2  3
B     1       4  5
      2       6  7
      3       8  9

In [33]:
a_df[1]['A']

second
1    1
2    3
Name: 1, dtype: int32

In [119]:
## OP2

In [120]:
from pyNastran.op2.op2 import OP2
op2 = OP2()

In [121]:
path = 'D:/DESKTOP-2020/PROJETOS_PESSOAIS/Python/1-Python para Engenheiros e Cientistas/Aulas editadas/Secao-9/model-001.op2'
op2.read_op2(path)

In [123]:
print(op2.get_op2_stats())

displacements[1]
  isubcase = 1
  type=RealDisplacementArray nnodes=858, table_name=OUGV1
  data: [t1, t2, t3, r1, r2, r3] shape=[1, 858, 6] dtype=float32
  node_gridtype.shape = (858, 2)
  sort1
  lsdvmns = [1]

ctria3_stress[1]
  type=RealPlateStressArray nelements=4 nnodes_per_element=1 nlayers=2 ntotal=8
  data: [1, ntotal, 8] where 8=[fiber_distance, oxx, oyy, txy, angle, omax, omin, von_mises]
  element_node.shape = (8, 2)
  data.shape=(1, 8, 8)
  element type: CTRIA3
  s_code: 1
  sort1
  lsdvmns = [1]

cquad4_stress[1]
  type=RealPlateStressArray nelements=784 nnodes_per_element=1 nlayers=2 ntotal=1568
  data: [1, ntotal, 8] where 8=[fiber_distance, oxx, oyy, txy, angle, omax, omin, von_mises]
  element_node.shape = (1568, 2)
  data.shape=(1, 1568, 8)
  element type: CQUAD4
  s_code: 1
  sort1
  lsdvmns = [1]

In [124]:
op2.cquad4_stress[1].data_frame

                           index  fiber_distance       oxx       oyy  \
ElementID NodeID Location
1         CEN    Top           0            -0.5  0.034607  1.319078
                 Bottom        1             0.5  0.034607  1.319078
3         CEN    Top           2            -0.5  2.077029  0.235260
                 Bottom        3             0.5  2.077029  0.235260
4         CEN    Top           4            -0.5 -0.169760  1.211231
...                          ...             ...       ...       ...
786       CEN    Bottom     1563             0.5 -0.000088  1.000032
787       CEN    Top        1564            -0.5  0.001810  0.999950
                 Bottom     1565             0.5  0.001810  0.999950
788       CEN    Top        1566            -0.5 -0.000035  0.999970
                 Bottom     1567             0.5 -0.000035  0.999970

                                txy      angle      omax      omin  von_mises
ElementID NodeID Location
1         CEN    Top       0.194984  81.555817  1.348024  0.005661   1.345202
                 Bottom    0.194984  81.555817  1.348024  0.005661   1.345202
3         CEN    Top      -0.032872  -1.022184  2.077615  0.234674   1.970786
                 Bottom   -0.032872  -1.022184  2.077615  0.234674   1.970786
4         CEN    Top       0.141299  84.217476  1.225540 -0.184069   1.327183
...                             ...        ...       ...       ...        ...
786       CEN    Bottom   -0.000643 -89.963158  1.000032 -0.000088   1.000077
787       CEN    Top      -0.000374 -89.978500  0.999950  0.001810   0.999046
                 Bottom   -0.000374 -89.978500  0.999950  0.001810   0.999046
788       CEN    Top      -0.000262 -89.984970  0.999970 -0.000035   0.999988
                 Bottom   -0.000262 -89.984970  0.999970 -0.000035   0.999988

[1568 rows x 9 columns]

In [125]:
op2.cquad4_stress[1].data_frame.index

MultiIndex([(  1, 'CEN',    'Top'),
            (  1, 'CEN', 'Bottom'),
            (  3, 'CEN',    'Top'),
            (  3, 'CEN', 'Bottom'),
            (  4, 'CEN',    'Top'),
            (  4, 'CEN', 'Bottom'),
            (  5, 'CEN',    'Top'),
            (  5, 'CEN', 'Bottom'),
            (  6, 'CEN',    'Top'),
            (  6, 'CEN', 'Bottom'),
            ...
            (784, 'CEN',    'Top'),
            (784, 'CEN', 'Bottom'),
            (785, 'CEN',    'Top'),
            (785, 'CEN', 'Bottom'),
            (786, 'CEN',    'Top'),
            (786, 'CEN', 'Bottom'),
            (787, 'CEN',    'Top'),
            (787, 'CEN', 'Bottom'),
            (788, 'CEN',    'Top'),
            (788, 'CEN', 'Bottom')],
           names=['ElementID', 'NodeID', 'Location'], length=1568)

## 9.12 Regressão linear com statsmodels

**Estrutura:**

Sejam **X** e **Y** dois arrays, ou Series, ou listas, onde:

$$ Y = cte + cX $$



```python
>>>import statsmodels.api as sm #para importar a biblioteca
>>>X = sm.add_constant(X) #adiciona a constante da regressão linear, se desejável
>>>est = sm.OLS(Y,X).fit() #gera o objeto de regressão linear baseada em X e Y
>>>est.params #retorna os parâmetros da regressão linear
>>>print(est.summary()) #imprime um relatório estatístico da regressão linear

```

In [1]:
# A ser preenchida pelo aluno

## 9.13 Desafio - regressão linear: correlação com dados reais

Faça uma regressão linear com os dados da NBA e encontre a correlação com o peso dos atletas.
- Encontre a correlaçao de peso e altura
- Encontre a correlação entre idade e altura
- Encontre a correlação com multiplas variáveis (peso com altura e idade)


Nome do arquivo: file = 'datasets_1358_30676_Players.csv'

In [2]:
# A ser preenchida pelo aluno